mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/crypto/nrf_crypto/test_app/test_cases/test_aes.c
/**
 * Copyright (c) 2018 - 2018, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

#include <stdio.h>
#include <stdarg.h>
#include <string.h>
#include <stddef.h>
#include "boards.h"
#include "app_util.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_error.h"
#include "nrf_crypto.h"
#include "nrf_section.h"
#include "common_test.h"
#include "nrf_log_default_backends.h"
#include "nrf_log_ctrl.h"
#include "nrf_log.h"


#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES)

NRF_SECTION_DEF(test_vector_aes_data, test_vector_aes_t);
NRF_SECTION_DEF(test_vector_aes_mac_data, test_vector_aes_t);
NRF_SECTION_DEF(test_vector_aes_func_data, test_vector_aes_t);
NRF_SECTION_DEF(test_vector_aes_monte_carlo_data, test_vector_aes_t);

#define NUM_BUFFER_OVERFLOW_TEST_BYTES          2                                                                               /**< Number of bytes to be using in overflow test for AES. */
#define CFB_MONTE_CARLO_CIPHER_ARRAY_LEN        32                                                                              /**< Number of bytes in AES CFB ciphertext array in AES Monte Carlo test. */
#define AES_IV_MAX_SIZE                         16                                                                              /**< Maximum AES IV size. */
#define AES_MAC_INPUT_BLOCK_SIZE                16                                                                              /**< Maximum AES MAC input block size. */
#define AES_PLAINTEXT_BUF_SIZE                  256                                                                             /**< Input buffer size for AES Plaintext. */
#define AES_PLAINTEXT_BUF_SIZE_PLUS             AES_PLAINTEXT_BUF_SIZE + NUM_BUFFER_OVERFLOW_TEST_BYTES                         /**< Input buffer size for AES Plaintext, including 2 buffer overflow bytes. */
#define AES_MAX_KEY_SIZE                        NRF_CRYPTO_KEY_SIZE_256 / 8                                                     /**< AES maximum key size. */
#define AES_MIN_KEY_SIZE                        NRF_CRYPTO_KEY_SIZE_128 / 8                                                     /**< AES minimum key size. */
#define TEST_VECTOR_AES_GET(i)                  NRF_SECTION_ITEM_GET(test_vector_aes_data, test_vector_aes_t, (i))              /**< Get number of AES test vectors. */
#define TEST_VECTOR_AES_COUNT                   NRF_SECTION_ITEM_COUNT(test_vector_aes_data, test_vector_aes_t)                 /**< Get test vector reference from array of test vectors. */
#define TEST_VECTOR_AES_MAC_GET(i)              NRF_SECTION_ITEM_GET(test_vector_aes_mac_data, test_vector_aes_t, (i))          /**< Get number of AES MAC test vectors. */
#define TEST_VECTOR_AES_MAC_COUNT               NRF_SECTION_ITEM_COUNT(test_vector_aes_mac_data, test_vector_aes_t)             /**< Get test vector reference from array of test vectors. */
#define TEST_VECTOR_AES_MULTI_GET(i)            NRF_SECTION_ITEM_GET(test_vector_aes_monte_carlo_data, test_vector_aes_t, (i))  /**< Get number of AES multi test vectors. */
#define TEST_VECTOR_AES_MULTI_COUNT             NRF_SECTION_ITEM_COUNT(test_vector_aes_monte_carlo_data, test_vector_aes_t)     /**< Get test vector reference from array of test vectors. */
#define TEST_VECTOR_AES_FUNCTIONAL_GET(i)       NRF_SECTION_ITEM_GET(test_vector_aes_func_data, test_vector_aes_t, (i))         /**< Get number of AES funtional test vectors. */
#define TEST_VECTOR_AES_FUNCTIONAL_COUNT        NRF_SECTION_ITEM_COUNT(test_vector_aes_func_data, test_vector_aes_t)            /**< Get test vector reference from array of test vectors. */

static nrf_crypto_aes_context_t m_aes_context;                                                                                  /**< AES context. */

static uint8_t                  m_aes_input_buf[AES_PLAINTEXT_BUF_SIZE_PLUS];                                                   /**< Buffer for holding the plaintext. */
static uint8_t                  m_aes_output_buf[AES_PLAINTEXT_BUF_SIZE_PLUS];                                                  /**< Buffer for holding the generated plaintext or ciphertext. */
static uint8_t                  m_aes_expected_output_buf[AES_PLAINTEXT_BUF_SIZE_PLUS];                                         /**< Buffer for holding the ciphertext. */
static uint8_t                  m_prev_aes_output_buf[AES_PLAINTEXT_BUF_SIZE_PLUS];                                             /**< Buffer for holding the previous generated ciphertext or plaintext. */
static uint8_t                  m_aes_key_buf[AES_MAX_KEY_SIZE];                                                                /**< Buffer for holding the key data. */
static uint8_t                  m_aes_iv_buf[AES_IV_MAX_SIZE + NUM_BUFFER_OVERFLOW_TEST_BYTES];                                 /**< Buffer for holding the IV data. */
static uint8_t                  m_aes_temp_buf[AES_MAX_KEY_SIZE];                                                               /**< Buffer for holding the temporary data. */


