mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/crypto/nrf_crypto/test_app/test_cases/test_aes.c
/**@brief Function for updating the AES key buffer based on the algorithms
 *  in NIST Monte Carlo test cases.
 *
 * @param[in]  key_len          Length of AES key in bytes.
 * @param[in]  ciphertext_len   Length of ciphertext in bytes.
 *
 */
void ecb_cbc_monte_carlo_update_key(size_t key_len, size_t ciphertext_len)
{
    uint8_t  divider;
    divider = key_len - ciphertext_len;

    // Xor previous cipher with key if key_len > cipher_len.
    for (uint8_t xor_start = 0; xor_start < divider; xor_start++)
    {
        m_aes_key_buf[xor_start] ^= m_prev_aes_output_buf[ciphertext_len - divider + xor_start];
    }

    // Xor cipher with last 16 bytes of key.
    for (uint8_t xor_start = 0; xor_start < ciphertext_len; xor_start++)
    {
        m_aes_key_buf[divider + xor_start] ^= m_aes_output_buf[xor_start];
    }
}

/**@brief Function for handling the AES ECB encryption/decryption in NIST Monte Carlo test cases.
 *
 * @details Check out NIST The Advanced Encryption Standard Algorithm Validation Suite (AESAVS)
 *  for more information about the Monte Carlo algorithm.
 *
 * @param[in]  p_test_info      Pointer to test case information variable.
 * @param[in]  p_test_vector    Pointer to test vector information variable.
 * @param[in]  p_aes_context    Pointer to aes context variable.
 * @param[in]  key_len          Length of AES key in bytes.
 * @param[in]  input_len        Length of AES input in bytes.
 * @param[in]  output_len       Length of AES output in bytes.
 *
 * @return NRF_SUCCESS on success.
 */
ret_code_t ecb_monte_carlo(test_info_t *                  p_test_info,
                           test_vector_aes_t *            p_test_vector,
                           nrf_crypto_aes_context_t *     p_aes_context,
                           size_t                         key_len,
                           size_t                         input_len,
                           size_t                         output_len)
{
    uint16_t j;
    ret_code_t err_code;

    // Execution encryption/decryption 1000 times with same AES key.
    for (j = 0; j < 1000; j++)
    {
        memcpy(m_prev_aes_output_buf, m_aes_output_buf, sizeof(m_prev_aes_output_buf));
        err_code = nrf_crypto_aes_update(p_aes_context,
                                         m_aes_input_buf,
                                         input_len,
                                         m_aes_output_buf);
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                    "nrf_crypto_aes_blocks_crypt");
        memcpy(m_aes_input_buf, m_aes_output_buf, input_len);
    }

    // Update AES key.
    ecb_cbc_monte_carlo_update_key(key_len, output_len);
    err_code = nrf_crypto_aes_key_set(p_aes_context, m_aes_key_buf);
    TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                "nrf_crypto_aes_key_set");

exit_test_vector:

        return err_code;
}


/**@brief Function for handling the AES CBC encryption/decryption in NIST Monte Carlo test cases.
 *
 * @details Check out NIST The Advanced Encryption Standard Algorithm Validation Suite (AESAVS)
 *  for more information about the Monte Carlo algorithm.
 *
 * @param[in]  p_test_info      Pointer to test case information variable.
 * @param[in]  p_test_vector    Pointer to test vector information variable.
 * @param[in]  p_aes_context    Pointer to aes context variable.
 * @param[in]  key_len          Length of AES key in bytes.
 * @param[in]  input_len        Length of AES input in bytes.
 * @param[in]  output_len       Length of AES output in bytes.
 * @param[in]  iv_len           Length of AES IV in bytes.
 *
 * @return NRF_SUCCESS on success.
 */
ret_code_t cbc_monte_carlo(test_info_t *                  p_test_info,
                           test_vector_aes_t *            p_test_vector,
                           nrf_crypto_aes_context_t *     p_aes_context,
                           size_t                         key_len,
                           size_t                         input_len,
                           size_t                         output_len,
                           size_t                         iv_len)
{
    uint16_t j;
    ret_code_t err_code;

    // Execution encryption/decryption 1000 times with same AES key.
    for (j = 0; j < 1000; j++)
    {
        memcpy(m_prev_aes_output_buf, m_aes_output_buf, sizeof(m_prev_aes_output_buf));
        err_code = nrf_crypto_aes_update(p_aes_context,
                                         m_aes_input_buf,
                                         input_len,
                                         m_aes_output_buf);
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                    "nrf_crypto_aes_blocks_crypt");

        if (j == 0)
        {
            memcpy(m_aes_input_buf, m_aes_iv_buf, input_len);
        }
        else
        {
            memcpy(m_aes_input_buf, m_prev_aes_output_buf, input_len);
        }
    }

    // Update AES key.
    ecb_cbc_monte_carlo_update_key(key_len, output_len);
    err_code = nrf_crypto_aes_key_set(p_aes_context, m_aes_key_buf);
    TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                "nrf_crypto_aes_key_set");

    // Update AES IV.
    memcpy(m_aes_iv_buf, m_aes_output_buf, iv_len);
    err_code = nrf_crypto_aes_iv_set(p_aes_context, m_aes_iv_buf);
    TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                "nrf_crypto_aes_iv_set");

exit_test_vector:

    return err_code;
}


/**@brief Function for handling the AES CFB8 encryption/decryption in NIST Monte Carlo test cases.
 *
 * @details Check out NIST The Advanced Encryption Standard Algorithm Validation Suite (AESAVS)
 *  for more information about the Monte Carlo algorithm.
 *
 * @param[in]  p_test_info      Pointer to test case information variable.
 * @param[in]  p_test_vector    Pointer to test vector information variable.
 * @param[in]  p_aes_context    Pointer to aes context variable.
 * @param[in]  key_len          Length of AES key in bytes.
 * @param[in]  input_len        Length of AES input in bytes.
 * @param[in]  output_len       Length of AES output in bytes.
 * @param[in]  iv_len           Length of AES IV in bytes.
 *
 * @return NRF_SUCCESS on success.
 */
ret_code_t cfb8_monte_carlo(test_info_t *                  p_test_info,
                            test_vector_aes_t *            p_test_vector,
                            nrf_crypto_aes_context_t *     p_aes_context,
                            size_t                         key_len,
                            size_t                         input_len,
                            size_t                         output_len,
                            size_t                         iv_len)
{
    uint16_t j;
    ret_code_t err_code;
    uint8_t  oldest_cipher_index;
    uint8_t  current_cipher_index;
    uint8_t  remaining_cipher_elements;
    uint8_t  cipher_array[CFB_MONTE_CARLO_CIPHER_ARRAY_LEN] = {0};

    if ((key_len < AES_MIN_KEY_SIZE) || (key_len > AES_MAX_KEY_SIZE))
    {
        return NRF_ERROR_CRYPTO_KEY_SIZE;
    }

    // Execution encryption/decryption 1000 times with same AES key.
    for (j = 0; j < 1000; j++)
    {
        err_code = nrf_crypto_aes_update(p_aes_context,
                                         m_aes_input_buf,
                                         input_len,
                                         m_aes_output_buf);
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                    "nrf_crypto_aes_update");

