mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/crypto/nrf_crypto/test_app/test_cases/test_aes.c
        if (j < 16)
        {
            m_aes_input_buf[0] = m_aes_iv_buf[j];
        }
        else
        {
            m_aes_input_buf[0] = cipher_array[(j - 16) % CFB_MONTE_CARLO_CIPHER_ARRAY_LEN];
        }

        cipher_array[j % CFB_MONTE_CARLO_CIPHER_ARRAY_LEN] = m_aes_output_buf[0];
    }

    // Variables needed for AES key calculation.
    current_cipher_index      = (j - 1) % CFB_MONTE_CARLO_CIPHER_ARRAY_LEN;
    oldest_cipher_index       = (current_cipher_index - key_len + 1) % CFB_MONTE_CARLO_CIPHER_ARRAY_LEN;
    remaining_cipher_elements = CFB_MONTE_CARLO_CIPHER_ARRAY_LEN - oldest_cipher_index;

    // Use m_aes_temp_buf as temporary buffer.
    memcpy(m_aes_temp_buf,
           &cipher_array[oldest_cipher_index],
           remaining_cipher_elements);
    memcpy(&m_aes_temp_buf[remaining_cipher_elements],
           cipher_array,
           key_len - remaining_cipher_elements);

    // Xor key with ciphers.
    for (uint8_t xor_start = 0; xor_start < key_len; xor_start++)
    {
        m_aes_key_buf[xor_start] ^= m_aes_temp_buf[xor_start];
    }

    // Update AES key.
    err_code = nrf_crypto_aes_key_set(p_aes_context, m_aes_key_buf);
    TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                "nrf_crypto_aes_key_set");

    // Update AES IV.
    /*lint -save -e662 */
    memcpy(m_aes_iv_buf, &m_aes_temp_buf[key_len - 16], iv_len);
    err_code = nrf_crypto_aes_iv_set(p_aes_context, m_aes_iv_buf);
    TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                "nrf_crypto_aes_iv_set");

exit_test_vector:

    return err_code;
}


/**@brief Function for running test setup.
 */
ret_code_t setup_test_case_aes(void)
{
    return NRF_SUCCESS;
}


/**@brief Function for AES functional test execution.
 */
ret_code_t exec_test_case_aes_functional(test_info_t * p_test_info)
{
    uint32_t i;
    ret_code_t err_code;
    uint32_t aes_test_vector_count;
    size_t   iv_len;
    size_t   input_len;
    size_t   output_len;

    aes_test_vector_count = TEST_VECTOR_AES_FUNCTIONAL_COUNT;

    for (i = 0; i < aes_test_vector_count; i++)
    {
        test_vector_aes_t * p_test_vector = TEST_VECTOR_AES_FUNCTIONAL_GET(i);
        p_test_info->current_id++;

        // Reset buffers and fetch test vectors.
        memset(m_aes_input_buf, 0xFF, sizeof(m_aes_input_buf));
        memset(m_aes_output_buf, 0xFF, sizeof(m_aes_output_buf));
        memset(m_aes_expected_output_buf, 0x00, sizeof(m_aes_expected_output_buf));

        input_len  = unhexify(m_aes_input_buf, p_test_vector->p_plaintext);
        output_len = unhexify(m_aes_expected_output_buf, p_test_vector->p_ciphertext);

        // Initialize AES to encrypt.
        err_code = nrf_crypto_aes_init(&m_aes_context,
                                       p_test_vector->p_aes_info,
                                       NRF_CRYPTO_ENCRYPT);
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == NRF_SUCCESS),
                                    "nrf_crypto_aes_init on encrypt");

        // Fetch and set AES key.
        memset(m_aes_key_buf, 0x00, sizeof(m_aes_key_buf));
        (void)unhexify(m_aes_key_buf, p_test_vector->p_key);
        err_code = nrf_crypto_aes_key_set(&m_aes_context, m_aes_key_buf);

        // Fetch and set AES IV.
        memset(m_aes_iv_buf, 0x00, sizeof(m_aes_iv_buf));
        iv_len = unhexify(m_aes_iv_buf, p_test_vector->p_iv);
        if (iv_len != 0)
        {
            err_code = nrf_crypto_aes_iv_set(&m_aes_context, m_aes_iv_buf);
        }

        // Encrypt input plaintext.
        start_time_measurement();
        err_code = nrf_crypto_aes_finalize(&m_aes_context,
                                           m_aes_input_buf,
                                           input_len,
                                           m_aes_output_buf,
                                           &output_len);
        stop_time_measurement();

        // Verify nrf_crypto_aes_finalize err_code.
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                    "nrf_crypto_aes_finalize on encrypt");

        // Verify generated AES ciphertext.
        TEST_VECTOR_MEMCMP_ASSERT(m_aes_expected_output_buf,
                                  m_aes_output_buf,
                                  output_len,
                                  p_test_vector->expected_result,
                                  "Incorrect generated AES ciphertext");

        // Verify that next two bytes in buffers are not overwritten.
        TEST_VECTOR_OVERFLOW_ASSERT(m_aes_output_buf, output_len, "output buffer overflow");
        TEST_VECTOR_OVERFLOW_ASSERT(m_aes_input_buf, input_len, "input buffer overflow");

        // Reset buffers and re-fetch test vectors.
        memset(m_aes_input_buf, 0xFF, sizeof(m_aes_input_buf));
        memset(m_aes_output_buf, 0xFF, sizeof(m_aes_output_buf));
        memset(m_aes_expected_output_buf, 0x00, sizeof(m_aes_expected_output_buf));

        // Fetch and unhexify plaintext and ciphertext.
        input_len  = unhexify(m_aes_input_buf, p_test_vector->p_ciphertext);
        output_len = unhexify(m_aes_expected_output_buf, p_test_vector->p_plaintext);

        // Initialize AES to decrypt.
        err_code = nrf_crypto_aes_init(&m_aes_context,
                                       p_test_vector->p_aes_info,
                                       NRF_CRYPTO_DECRYPT);

        TEST_VECTOR_ASSERT_ERR_CODE((err_code == NRF_SUCCESS),
                                    "nrf_crypto_aes_init on decrypt");

        // Fetch and set AES key.
        memset(m_aes_key_buf, 0x00, sizeof(m_aes_key_buf));
        (void)unhexify(m_aes_key_buf, p_test_vector->p_key);
        err_code = nrf_crypto_aes_key_set(&m_aes_context, m_aes_key_buf);

