mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/crypto/nrf_crypto/test_app/test_cases/test_aes.c
        // Fetch and set AES IV.
        memset(m_aes_iv_buf, 0x00, sizeof(m_aes_iv_buf));
        iv_len = unhexify(m_aes_iv_buf, p_test_vector->p_iv);
        if (iv_len != 0)
        {
            err_code = nrf_crypto_aes_iv_set(&m_aes_context, m_aes_iv_buf);
        }

        // Decrypt input ciphertext.
        err_code = nrf_crypto_aes_finalize(&m_aes_context,
                                           m_aes_input_buf,
                                           input_len,
                                           m_aes_output_buf,
                                           &output_len);

        // Verify nrf_crypto_aes_finalize err_code.
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                    "nrf_crypto_aes_finalize on decrypt");

        // Verify generated AES plaintext.
        TEST_VECTOR_MEMCMP_ASSERT(m_aes_expected_output_buf,
                                  m_aes_output_buf,
                                  output_len,
                                  p_test_vector->expected_result,
                                  "Incorrect generated AES plaintext");

        // Verify that next two bytes in buffers are not overwritten.
        TEST_VECTOR_OVERFLOW_ASSERT(m_aes_output_buf, output_len, "output buffer overflow");
        TEST_VECTOR_OVERFLOW_ASSERT(m_aes_input_buf, input_len, "input buffer overflow");

        NRF_LOG_INFO("#%04d Test vector passed: %s %s",
                     p_test_info->current_id,
                     p_test_info->p_test_case_name,
                     p_test_vector->p_test_vector_name);

        p_test_info->tests_passed++;

exit_test_vector:

        // Un-initialize AES.
        (void) nrf_crypto_aes_uninit(&m_aes_context);

        while (NRF_LOG_PROCESS());

    }
    return NRF_SUCCESS;
}

/**@brief Function for AES test execution.
 */
ret_code_t exec_test_case_aes(test_info_t * p_test_info)
{
    uint32_t i;
    ret_code_t err_code;
    uint32_t aes_test_vector_count;
    size_t   iv_len;
    size_t   ad_len;
    size_t   input_len;
    size_t   output_len;

    aes_test_vector_count = TEST_VECTOR_AES_COUNT;

    for (i = 0; i < aes_test_vector_count; i++)
    {
        test_vector_aes_t * p_test_vector = TEST_VECTOR_AES_GET(i);
        p_test_info->current_id++;

        // Reset buffers and fetch test vectors.
        memset(m_aes_input_buf, 0xFF, sizeof(m_aes_input_buf));
        memset(m_aes_expected_output_buf, 0xFF, sizeof(m_aes_expected_output_buf));
        memset(m_aes_output_buf, 0x00, sizeof(m_aes_output_buf));

        // Fetch and unhexify plaintext and ciphertext.
        if (p_test_vector->direction == NRF_CRYPTO_ENCRYPT)
        {
            input_len  = unhexify(m_aes_input_buf, p_test_vector->p_plaintext);
            output_len = unhexify(m_aes_expected_output_buf, p_test_vector->p_ciphertext);
        }
        else
        {
            output_len = unhexify(m_aes_expected_output_buf, p_test_vector->p_plaintext);
            input_len  = unhexify(m_aes_input_buf, p_test_vector->p_ciphertext);
        }

        // Initialize AES.
        err_code = nrf_crypto_aes_init(&m_aes_context,
                                       p_test_vector->p_aes_info,
                                       p_test_vector->direction);

        // Fetch and set AES key.
        memset(m_aes_key_buf, 0x00, sizeof(m_aes_key_buf));
        (void)unhexify(m_aes_key_buf, p_test_vector->p_key);
        err_code = nrf_crypto_aes_key_set(&m_aes_context, m_aes_key_buf);

        // Fetch and set AES IV.
        memset(m_aes_iv_buf, 0xFF, sizeof(m_aes_iv_buf));
        iv_len = unhexify(m_aes_iv_buf, p_test_vector->p_iv);
        if (iv_len != 0)
        {
            err_code = nrf_crypto_aes_iv_set(&m_aes_context, m_aes_iv_buf);
            TEST_VECTOR_ASSERT_ERR_CODE((err_code == NRF_SUCCESS),
                                        "nrf_crypto_aes_iv_set");
        }

        // Encrypt/Decrypt input.
        start_time_measurement();
        err_code = nrf_crypto_aes_finalize(&m_aes_context,
                                           m_aes_input_buf,
                                           input_len,
                                           m_aes_output_buf,
                                           &output_len);
        stop_time_measurement();

        // Verify nrf_crypto_aes_finalize err_code.
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                    "nrf_crypto_aes_finalize");

        // Verify generated AES ciphertext.
        TEST_VECTOR_MEMCMP_ASSERT(m_aes_expected_output_buf,
                                  m_aes_output_buf,
                                  input_len,
                                  p_test_vector->expected_result,
                                  "Incorrect generated AES ciphertext");

        if (p_test_vector->p_aes_info->mode == NRF_CRYPTO_AES_MODE_CTR)
        {
            // Read current counter value for AES CTR mode.
            memset(m_aes_temp_buf, 0xFF, sizeof(m_aes_temp_buf));
            ad_len = unhexify(m_aes_temp_buf, p_test_vector->p_ad);
            err_code = nrf_crypto_aes_iv_get(&m_aes_context, m_aes_iv_buf);
            TEST_VECTOR_ASSERT_ERR_CODE((err_code == NRF_SUCCESS), "nrf_crypto_aes_iv_get");

            // Verify that counter value has incremented as expected.
            TEST_VECTOR_MEMCMP_ASSERT(m_aes_iv_buf,
                                      m_aes_temp_buf,
                                      ad_len,
                                      NRF_SUCCESS,
                                      "Incorrect incremented counter value.");

            // Verify that next two bytes in buffers are not overwritten.
            TEST_VECTOR_OVERFLOW_ASSERT(m_aes_iv_buf, iv_len, "IV buffer overflow");
        }

        NRF_LOG_INFO("#%04d Test vector passed: %s %s",
                     p_test_info->current_id,
                     p_test_info->p_test_case_name,
                     p_test_vector->p_test_vector_name);
        p_test_info->tests_passed++;

exit_test_vector:

