mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/crypto/nrf_crypto/test_app/test_cases/test_aes.c
        // Un-initialize AES.
        (void) nrf_crypto_aes_uninit(&m_aes_context);

        while (NRF_LOG_PROCESS());

    }
    return NRF_SUCCESS;
}


/**@brief Function for AES MAC test execution.
 */
ret_code_t exec_test_case_aes_mac(test_info_t * p_test_info)
{
    uint32_t i;
    ret_code_t err_code;
    uint32_t aes_test_vector_count;
    size_t   input_len;
    size_t   output_len;
    size_t   input_remaining;

    aes_test_vector_count = TEST_VECTOR_AES_MAC_COUNT;

    for (i = 0; i < aes_test_vector_count; i++)
    {
        test_vector_aes_t * p_test_vector = TEST_VECTOR_AES_MAC_GET(i);
        p_test_info->current_id++;

        // Reset buffers and fetch test vectors.
        memset(m_aes_input_buf, 0xFF, sizeof(m_aes_input_buf));
        memset(m_aes_expected_output_buf, 0xFF, sizeof(m_aes_expected_output_buf));
        memset(m_aes_output_buf, 0x00, sizeof(m_aes_output_buf));

        output_len = 16;
        input_len = unhexify(m_aes_input_buf, p_test_vector->p_plaintext);
        (void)unhexify(m_aes_expected_output_buf, p_test_vector->p_ciphertext);

        // Initialize AES.
        err_code = nrf_crypto_aes_init(&m_aes_context,
                                       p_test_vector->p_aes_info,
                                       NRF_CRYPTO_MAC_CALCULATE);
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == NRF_SUCCESS), "nrf_crypto_aes_init");

        // Fetch and set AES key.
        memset(m_aes_key_buf, 0x00, sizeof(m_aes_key_buf));
        (void)unhexify(m_aes_key_buf, p_test_vector->p_key);
        err_code = nrf_crypto_aes_key_set(&m_aes_context, m_aes_key_buf);
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == NRF_SUCCESS), "nrf_crypto_aes_key_set");

        // Do quick AES MAC calculation.
        start_time_measurement();
        err_code = nrf_crypto_aes_finalize(&m_aes_context,
                                           m_aes_input_buf,
                                           input_len,
                                           m_aes_output_buf,
                                           &output_len);
        stop_time_measurement();

        // Verify nrf_crypto_aes_mac_calculate err_code.
        TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                    "nrf_crypto_aes_finalize");

        // Verify generated AES MAC.
        TEST_VECTOR_ASSERT((output_len == 16), "output_len is not 16");
        TEST_VECTOR_MEMCMP_ASSERT(m_aes_expected_output_buf,
                                  m_aes_output_buf,
                                  output_len,
                                  p_test_vector->expected_result,
                                  "Incorrect generated AES MAC");

        // Also perform a multi update MAC calculation.
        if (input_len > 0)
        {
            size_t buffer_index;
            // Execute same test vector again, in blocks of 16 bytes.
            input_remaining = input_len;
            memset(m_aes_output_buf, 0x00, sizeof(m_aes_output_buf));

            // Initialize AES.
            err_code = nrf_crypto_aes_init(&m_aes_context,
                                           p_test_vector->p_aes_info,
                                           NRF_CRYPTO_MAC_CALCULATE);
            TEST_VECTOR_ASSERT_ERR_CODE((err_code == NRF_SUCCESS),
                                        "nrf_crypto_aes_init multi");

            // Set AES key.
            err_code = nrf_crypto_aes_key_set(&m_aes_context, m_aes_key_buf);
            TEST_VECTOR_ASSERT_ERR_CODE((err_code == NRF_SUCCESS),
                                        "nrf_crypto_aes_key_set multi");

            while (input_remaining)
            {
                buffer_index = input_len - input_remaining;
                if (input_remaining <= AES_MAC_INPUT_BLOCK_SIZE)
                {
                    // Update with final input and calculate MAC.
                    output_len = AES_MAC_INPUT_BLOCK_SIZE;
                    err_code   = nrf_crypto_aes_finalize(&m_aes_context,
                                                         &m_aes_input_buf[buffer_index],
                                                         input_remaining,
                                                         m_aes_output_buf,
                                                         &output_len);
                    input_remaining = 0;
                }
                else
                {
                    // Update with 16 bytes input.
                    output_len = 0;
                    err_code   = nrf_crypto_aes_update(&m_aes_context,
                                                       &m_aes_input_buf[buffer_index],
                                                       AES_MAC_INPUT_BLOCK_SIZE,                                        
                                                       m_aes_output_buf);
                    input_remaining -= AES_MAC_INPUT_BLOCK_SIZE;
                }
                TEST_VECTOR_ASSERT_ERR_CODE((err_code == p_test_vector->expected_err_code),
                                            "nrf_crypto_aes_mac_calculate multi");
            }

            // Verify generated AES MAC.
            TEST_VECTOR_ASSERT((output_len == 16), "output_len is not 16");
            TEST_VECTOR_MEMCMP_ASSERT(m_aes_expected_output_buf,
                                      m_aes_output_buf,
                                      output_len,
                                      p_test_vector->expected_result,
                                      "Incorrect generated AES MAC second");
        }
        NRF_LOG_INFO("#%04d Test vector passed: %s %s",
                     p_test_info->current_id,
                     p_test_info->p_test_case_name,
                     p_test_vector->p_test_vector_name);

        p_test_info->tests_passed++;

exit_test_vector:

