mafaneh/ble-ebook-project/nRF5_SDK_15.0.0_a53641a/examples/crypto/nrf_crypto/test_app/test_cases/test_aes.c
        // Un-initialize AES.
        (void) nrf_crypto_aes_uninit(&m_aes_context);

        while (NRF_LOG_PROCESS());

    }
    return NRF_SUCCESS;
}


/**@brief Function for AES Monte Carlo test execution.
 */
ret_code_t exec_test_case_aes_monte_carlo(test_info_t * p_test_info)
{
    uint16_t i;
    uint16_t k;
    ret_code_t err_code;
    uint32_t aes_test_vector_count;
    size_t   iv_len;
    size_t   key_len;
    size_t   input_len;
    size_t   output_len;

    aes_test_vector_count = TEST_VECTOR_AES_MULTI_COUNT;

    for (i = 0; i < aes_test_vector_count; i++)
    {
        test_vector_aes_t * p_test_vector = TEST_VECTOR_AES_MULTI_GET(i);
        p_test_info->current_id++;

        // Reset buffers and fetch test vectors.
        memset(m_aes_input_buf, 0xFF, sizeof(m_aes_input_buf));
        memset(m_aes_expected_output_buf, 0xFF, sizeof(m_aes_expected_output_buf));
        memset(m_aes_output_buf, 0x00, sizeof(m_aes_output_buf));
        memset(m_prev_aes_output_buf, 0x00, sizeof(m_prev_aes_output_buf));

        // Fetch and unhexify plaintext and ciphertext.
        if (p_test_vector->direction == NRF_CRYPTO_ENCRYPT)
        {
            input_len  = unhexify(m_aes_input_buf, p_test_vector->p_plaintext);
            output_len = unhexify(m_aes_expected_output_buf, p_test_vector->p_ciphertext);
        }
        else
        {
            input_len  = unhexify(m_aes_input_buf, p_test_vector->p_ciphertext);
            output_len = unhexify(m_aes_expected_output_buf, p_test_vector->p_plaintext);
        }
        TEST_VECTOR_ASSERT((input_len == output_len),
                           "plaintext length not equal to ciphertext length");

        // Initialize AES.
        err_code = nrf_crypto_aes_init(&m_aes_context,
                                       p_test_vector->p_aes_info,
                                       p_test_vector->direction);

        // Fetch and set AES key.
        memset(m_aes_key_buf, 0x00, sizeof(m_aes_key_buf));
        key_len = unhexify(m_aes_key_buf, p_test_vector->p_key);
        err_code = nrf_crypto_aes_key_set(&m_aes_context, m_aes_key_buf);

        // Fetch and set AES IV.
        memset(m_aes_iv_buf, 0x00, sizeof(m_aes_iv_buf));
        iv_len = unhexify(m_aes_iv_buf, p_test_vector->p_iv);
        if (iv_len != 0)
        {
            err_code = nrf_crypto_aes_iv_set(&m_aes_context, m_aes_iv_buf);
        }

        // Start Monte Carlo test.
        start_time_measurement();
        for (k = 0; k < 100; k++)
        {
            switch(p_test_vector->p_aes_info->mode)
            {
                case NRF_CRYPTO_AES_MODE_ECB:
                    err_code = ecb_monte_carlo(p_test_info,
                                               p_test_vector,
                                               &m_aes_context,
                                               key_len,
                                               input_len,
                                               output_len);
                    if (err_code != p_test_vector->expected_err_code)
                    {
                        goto exit_test_vector;
                    }
                    break;

                case NRF_CRYPTO_AES_MODE_CBC:
                    err_code = cbc_monte_carlo(p_test_info,
                                               p_test_vector,
                                               &m_aes_context,
                                               key_len,
                                               input_len,
                                               output_len,
                                               iv_len);
                    if (err_code != p_test_vector->expected_err_code)
                    {
                        goto exit_test_vector;
                    }
                    break;

                case NRF_CRYPTO_AES_MODE_CFB:
                    err_code = cfb8_monte_carlo(p_test_info,
                                                p_test_vector,
                                                &m_aes_context,
                                                key_len,
                                                input_len,
                                                output_len,
                                                iv_len);
                    if (err_code != p_test_vector->expected_err_code)
                    {
                        goto exit_test_vector;
                    }
                    break;

                default:
                    break;
            }
        }

        // Verify generated AES plaintext/ciphertext.
        TEST_VECTOR_MEMCMP_ASSERT(m_aes_expected_output_buf,
                                  m_aes_output_buf,
                                  output_len,
                                  p_test_vector->expected_result,
                                  "Incorrect generated AES ciphertext");

        NRF_LOG_INFO("#%04d Test vector passed: %s %s",
                     p_test_info->current_id,
                     p_test_info->p_test_case_name,
                     p_test_vector->p_test_vector_name);

        p_test_info->tests_passed++;

exit_test_vector:
        stop_time_measurement();

        // Un-initialize AES.
        (void) nrf_crypto_aes_uninit(&m_aes_context);

        while (NRF_LOG_PROCESS());

    }
    return NRF_SUCCESS;
}


/**@brief Function for running test teardown.
 */
ret_code_t teardown_test_case_aes(void)
{
    return NRF_SUCCESS;
}


/** @brief  Macro for registering the AES funtional test case by using section variables.
 *
 * @details     This macro places a variable in a section named "test_case_data",
 *              which is initialized by main.
 */
NRF_SECTION_ITEM_REGISTER(test_case_data, test_case_t test_aes_encrypt_functional) =
{
    .p_test_case_name = "AES",
    .setup = setup_test_case_aes,
    .exec = exec_test_case_aes_functional,
    .teardown = teardown_test_case_aes
};


/** @brief  Macro for registering the AES test case by using section variables.
 *
 * @details     This macro places a variable in a section named "test_case_data",
 *              which is initialized by main.
 */
NRF_SECTION_ITEM_REGISTER(test_case_data, test_case_t test_aes_encrypt) =
{
    .p_test_case_name = "AES",
    .setup = setup_test_case_aes,
    .exec = exec_test_case_aes,
    .teardown = teardown_test_case_aes
};


/** @brief  Macro for registering the AES test case by using section variables.
 *
 * @details     This macro places a variable in a section named "test_case_data",
 *              which is initialized by main.
 */
NRF_SECTION_ITEM_REGISTER(test_case_data, test_case_t test_aes_mac) =
{
    .p_test_case_name = "AES",
    .setup = setup_test_case_aes,
    .exec = exec_test_case_aes_mac,
    .teardown = teardown_test_case_aes
};


/** @brief  Macro for registering the AES Monte Carlo test case by using section variables.
 *
 * @details     This macro places a variable in a section named "test_case_data",
 *              which is initialized by main.
 */
NRF_SECTION_ITEM_REGISTER(test_case_data, test_case_t test_aes_encrypt_monte_carlo) =
{
    .p_test_case_name = "AES",
    .setup = setup_test_case_aes,
    .exec = exec_test_case_aes_monte_carlo,
    .teardown = teardown_test_case_aes
};
/*lint -restore*/


#endif // NRF_CRYPTO_AES_ENABLED
